{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["Hi", "Hello", "How are you?", "Good morning"],
            "responses": ["Hello!", "Hi there!", "Greetings!", "How can I help you?"]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "Goodbye", "See you later"],
            "responses": ["Goodbye!", "See you!", "Take care!"]
        },
        {
            "tag": "age",
            "patterns": ["How old are you?", "What's your age?", "Tell me your age"],
            "responses": ["I am a chatbot, I don't age!", "I am ageless!", "I don't have an age."]
        },
        {
            "tag": "symptoms",
            "patterns": ["What are the symptoms of flu?", "What are common cold symptoms?", "Tell me symptoms of COVID-19"],
            "responses": [
                "The symptoms of flu include fever, cough, sore throat, and body aches.",
                "Common cold symptoms include sneezing, runny nose, and sore throat.",
                "COVID-19 symptoms include fever, cough, and difficulty breathing."
            ]
        },
        {
            "tag": "treatment",
            "patterns": ["What is the treatment for a cold?", "How can I treat a headache?", "What should I do for a fever?"],
            "responses": [
                "For a cold, it's important to stay hydrated, rest, and use over-the-counter cold medications.",
                "To treat a headache, you can try pain relievers like ibuprofen or acetaminophen.",
                "For a fever, it's best to stay hydrated and take fever-reducing medications like paracetamol."
            ]
        },
        {
            "tag": "diet",
            "patterns": ["What should I eat for a healthy diet?", "Tell me about a balanced diet", "What are some good foods for weight loss?"],
            "responses": [
                "A healthy diet includes fruits, vegetables, whole grains, lean proteins, and healthy fats.",
                "A balanced diet includes a variety of foods, focusing on moderation and portion control.",
                "For weight loss, focus on eating whole, nutrient-dense foods and avoiding processed sugars and fats."
            ]
        },
        {
            "tag": "exercise",
            "patterns": ["What are some good exercises for fitness?", "How can I get in shape?", "Give me some workout tips"],
            "responses": [
                "Good exercises for fitness include running, swimming, and strength training.",
                "To get in shape, aim for a combination of cardio and strength training exercises.",
                "It's important to warm up before exercising and cool down after to prevent injury."
            ]
        },
        {
            "tag": "mental_health",
            "patterns": ["How can I reduce stress?", "Tell me how to improve my mental health?", "What can I do to relax?"],
            "responses": [
                "To reduce stress, try deep breathing, meditation, or yoga.",
                "Improving mental health involves regular physical activity, proper sleep, and mindfulness.",
                "Relaxation techniques like taking a walk, reading, or practicing mindfulness can help relieve stress."
            ]
        },
        {
            "tag": "general_advice",
            "patterns": ["Give me some health tips", "Tell me how to stay healthy", "What are some general health tips?"],
            "responses": [
                "Drink plenty of water, exercise regularly, and eat a balanced diet to stay healthy.",
                "Get enough sleep, manage stress, and avoid smoking or excessive alcohol consumption.",
                "Remember to wash your hands regularly and get regular checkups with your doctor."
            ]
        },
        {
            "tag": "emergency",
            "patterns": ["What should I do in an emergency?", "What are the first aid steps?", "How do I handle a medical emergency?"],
            "responses": [
                "In case of an emergency, call your local emergency number immediately.",
                "For first aid, remember to assess the situation, keep the person calm, and apply necessary treatments like CPR if needed.",
                "For a medical emergency, stay calm, and seek professional medical help immediately."
            ]
        }
    ]
}
